9/data/attachments/c83e662c37400d12.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9262bf53-9deb-459c-90d9-9c33d3ce0574</nif:username>
            <nif:friendToBeAdded>Richard_rate_Friend_89514_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>